Revit 2027 API
Element.ArePhasesModifiable Method
 Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ArePhasesModifiable()
Public Function ArePhasesModifiable As Boolean
public:
bool ArePhasesModifiable()
member ArePhasesModifiable : unit -> bool
Return Value
Boolean
 True if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element, false otherwise.
Remarks
 Acts as a validator for setting the properties CreatedPhaseId and DemolishedPhaseId.
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace